cf/Tasks/ЗадачаПользователю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Task>
		<Properties>
			<Name>ЗадачаПользователю</Name>
			<Addressing>InformationRegister.РолиПользователей</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъедененнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъедененнаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параллельная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

cf/InformationRegisters/ИсторияПечатиСборочногоЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПечатиСборочногоЛиста</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗадачаПользователю</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПользователю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Tasks/ЗадачаПользователю/Ext/ManagerModule.bsl
Процедура УстановитьФлагПараллельныхЗадач(ПроцессСборка, Параллельность = Ложь, ТекЗадачаСсылка = Неопределено) Экспорт
	
	ВОЗВРАТ;
	
	// Устанавливает/снимает флаг паралелльности для задач по указанному БП
	
	ПаралелльныеМаршруты = Новый Массив;
	//ПаралелльныеМаршруты.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.СобратьТовары);
	//ПаралелльныеМаршруты.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.Переместить);
	//ПаралелльныеМаршруты.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.ВложеннаяСборка);
	//ПаралелльныеМаршруты.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.ВложеннаяСборка2);
	
	Сборки = Новый Массив;
	БизнесПроцессы.СборкаЗаказа.ДобавитьВложенныеСборки(ПроцессСборка, 	Сборки);
	БизнесПроцессы.СборкаЗаказа.ДобавитьСборкиРодители(ПроцессСборка, 	Сборки);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка ИЗ
	|	Задача.ЗадачаПользователю
	|ГДЕ
	|	БизнесПроцесс В(&Процессы) И
	|	Не Выполнена И
	|	Ссылка <> &ТекЗадачаСсылка И
	|	ТочкаМаршрута В(&ПаралелльныеМаршруты)
	|;
	|ВЫБРАТЬ Ссылка, Параллельная ИЗ
	|	Задача.ЗадачаПользователю
	|ГДЕ
	|	Не Выполнена И
	|	Ссылка <> &ТекЗадачаСсылка И
	|	БизнесПроцесс В(&Процессы) И
	|	ТочкаМаршрута = &ТочкаСкорректироватьЗаказ
	|");
	
	Запрос.УстановитьПараметр("ТочкаСкорректироватьЗаказ", 	БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.СкорректироватьЗаказ);
	Запрос.УстановитьПараметр("Процессы", 					Сборки);
	Запрос.УстановитьПараметр("ПаралелльныеМаршруты",		ПаралелльныеМаршруты);
	Запрос.УстановитьПараметр("ТекЗадачаСсылка",			ТекЗадачаСсылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	Параллельность = Не Пакет[0].Пустой();
	
	Выборка = Пакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл Если Выборка.Параллельная <> Параллельность Тогда
		
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.Параллельная = Параллельность;
		
		ЗадачаОбъект.Записать(); КонецЕсли; КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьСобытиеФормированияПечатнойФормы(ЗадачаСсылка) Экспорт
	
	ИсторияПечатиМенеджер = РегистрыСведений.ИсторияПечатиСборочногоЛиста.СоздатьМенеджерЗаписи();
	ИсторияПечатиМенеджер.Период = ТекущаяДата();
	ИсторияПечатиМенеджер.ЗадачаПользователю = ЗадачаСсылка;
	ИсторияПечатиМенеджер.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ИсторияПечатиМенеджер.Записать();
	
КонецПроцедуры

Функция ПолучитьСтрокуПризнакаПечати(ЗадачаСсылка) Экспорт
	
	СтрокаПризнакаПечати = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияПечатиСборочногоЛистаСрезПоследних.Период,
	|	ПРЕДСТАВЛЕНИЕ(ИсторияПечатиСборочногоЛистаСрезПоследних.Пользователь)
	|ИЗ
	|	РегистрСведений.ИсторияПечатиСборочногоЛиста.СрезПоследних(, ЗадачаПользователю = &ЗадачаПользователю) КАК ИсторияПечатиСборочногоЛистаСрезПоследних";
	
	Запрос.УстановитьПараметр("ЗадачаПользователю", ЗадачаСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		СтрокаПризнакаПечати = "Последняя печать выполнена пользователем " 
								+ Выборка.ПользовательПредставление
								+ " "
								+ Формат(Выборка.Период, "");
	КонецЕсли;
							
	Возврат СтрокаПризнакаПечати;
	
КонецФункции
